**Лабораторная работа 4**

**ТЕМА 3. Функции и модули**

**Лабораторные задания:**

1) Напишите функцию, которая выполняет любые арифметические
   действия и выводит результат в консоль. Вызовите функцию используя
   “точку входа”.
```
def main():
    print(1.1 * 33)


if __name__ == '__main__':
    main()

```
2) Напишите функцию, которая выполняет любые арифметические
   действия, возвращает при помощи return значение в место, откуда
   вызывали функцию. Выведите результат в консоль. Вызовите функцию
   используя “точку входа”.
   Ниже представлена точно такая же программа, как и выше, только
   написана более развернуто. В это программе стоит заметить что результат работы функции main() мы помещаем в переменную
   “answer”, в дальнейшем можно как-то работать с ним, не вызывая
   функцию повторно, что хорошо сказывается, например, на скорости
   работы программы

```
def main():
    return 1.1 * 33


if __name__ == '__main__':
    print(main())
```

3) Напишите функцию, в которую передаются два аргумента, над ними
   производится арифметическое действие, результат возвращается туда,
   откуда эту функцию вызывали. Выведите результат в консоль.
   Вызовите функцию в любом небольшом цикле.
   
```
def main(a, b):
    result = a * b
    return result


if __name__ == '__main__':
    x = 2
    y = 3
    answer = main(x, y)
    print(answer)
```
4) Напишите функцию, на вход которой подается какое-то изначальное
   неизвестное количество аргументов, над которыми будет производится
   арифметические действия. Для выполнения задания необходимо
   использовать кортеж “*args”.
```
def main(a, *args):
    one = a
    two = len(args)
    three = sum(args)
    print(f'one={one}\ntwo={two}\nthree={three}')
    return a * sum(args)


if __name__ == '__main__':
    print(main(2, 3, 4, 5, 6, 7))
```

5) Напишите функцию, которая на вход получает кортеж “**kwargs” и
   при помощи цикла выводит значения, поступившие в функцию. На
   скриншоте ниже указаны два варианта вызова функции с “**kwargs” и
   два варианта работы с данными, поступившими в эту функцию.
   Комментарии в коде и теоретическая часть помогут вам разобраться в
   этом нелегком аспекте. Вызовите функцию используя “точку входа”
```
def main(**kwargs):
    for i in kwargs.items():
        print(i[0], i[1])


if __name__ == '__main__':
    main(**{'1': [11], '2': [22], '3': [33]})

```
6) Напишите две функции. Первая – получает в виде параметра
   “**kwargs”. Вторая считает среднее арифметическое из значений
   первой функции. Вызовите первую функцию используя “точку входа”
   и минимум 4 аргумента
```
def main(**kwargs):
    for i in kwargs.items():
        print(i[0], mean(i[1]))


def mean(values):
    return sum(values) / float(len(values))


if __name__ == '__main__':
    main(**{'1': [11, 12, 13], '2': [22, 22, 22], '3': [12, 23, 34], '4': [32, 3, 4, 5]})


```
7) Создайте дополнительный файл .py. Напишите в нем любую функцию,
   которая будет что угодно выводить в консоль, но не вызывайте ее в
   нем. Откройте файл main.py, импортируйте в него функцию из нового
   файла и при помощи “точки входа” вызовите эту функцию.
```
from for_import import say_hi


if __name__ == '__main__':
    say_hi()
```
8) Напишите программу, которая будет выводить корень, синус, косинус
   полученного от пользователя числа
```
import math


def main():
    a = int(input("enter value = "))
    print(math.sin(a))
    print(math.cos(a))
    print(math.sqrt(a))


if __name__ == '__main__':
    main()
```
9) Напишите программу, которая будет рассчитывать какой день недели
   будет через n-нное количество дней, которые укажет пользователь.
```
from datetime import datetime as dt
from datetime import timedelta as td


def main():
    print(f'Сегодня {dt.today().date()}')
    print(f'День недели - {dt.today().isoweekday()}')
    n = int(input('Введите количество дней: '))
    result = dt.today() + td(days=n)
    print(f'Через {n} дней будет {result.date()}')
    print(f'День недели - {result.isoweekday()}')


if __name__ == '__main__':
    main()
```
10) Напишите программу с использованием глобальных переменных,
    которая будет считать площадь треугольника или прямоугольника в
    зависимости от того, что выберет пользователь. Получение всей
    необходимой информации реализовать через input(), а подсчет
    площадей выполнить при помощи функций. Результатом программы
    будет число, равное площади, необходимой фигуры.
```
global result


def rectangle():
    a = float(input('ширина='))
    b = float(input('высота='))
    global result
    result = a * b


def triangle():
    a = float(input('основание='))
    h = float(input('высота='))
    global result
    result = 0.5 * a * h


figure = input('1-прямоугольник 2-треугольник:')

if figure == '1':
    rectangle()
elif figure == '2':
    triangle()

print(f'Площадь={result}')
```
