**Лабораторная работа 5**

**ТЕМА 5. Базовые коллекции: множества, списки**

**Лабораторные задания:**

1) Друзья предложили вам поиграть в игру “найди отличия и убери
   повторения (версия для программистов)”. Суть игры состоит в том, что
   на вход программы поступает два множества, а ваша задача вывести
   все элементы первого, которых нет во втором. А вы как раз недавно
   прошли множества и знаете их возможности, поэтому это не составит
   для вас труда.
```
set1 = set(input("set1 = ").split())
set2 = set(input("set2 = ").split())


print(set1 - set2)
```
2) Напишите две одинаковые программы, только одна будет использовать
   set(), а вторая frozenset() и попробуйте к исходному множеству
   добавить несколько элементов, например, через цикл.

```
a = set('123123')
print(a)
for i in range(1, 5):
    a.add(i)
print(a)


b = frozenset('123123')
for i in range(1, 5):
    b.add(i)
print(b)

```

3) На вход в программу поступает список (минимальной длиной 2
   символа). Напишите программу, которая будет менять первый и
   последний элемент списка
```
def replace(a):
    a[0], a[-1] = a[-1], a[0]
    return a


b = [1, 2, 3]
replace(b)
print(b)


```
4) На вход в программу поступает список (минимальной длиной 10
   символов). Напишите программу, которая выводит элементы с
   индексами от 2 до 6. В программе необходимо использовать “срез”.
```
a = list(range(1, 12))
print(a[2:6])

```

5) Иван задумался о поиске «бесполезного» числа, полученного из
   списка. Суть поиска в следующем: он берет произвольный список
   чисел, находит самое большое из них, а затем делит его на длину
   списка. Студент пока не придумал, где может пригодиться подобное
   значение, но ищет у вас помощи в реализации такой функции useless().
```
def useless(lst):
    return max(lst) / len(lst)


print(useless([3, 44, 5, 2]))

```
6) Ребята не могут определится каким супергероем они хотят стать. У них
   есть случайно составленный список супергероев, и вы должны
   определить кто из ребят будет каким супергероем. Необходимо
   использовать разделение списков.
```
superheroes = ['superman', 'spiderman', 'batman']

nikolay, vasiliy, ivan = superheroes

print('Николай - ', nikolay)
print('Василий - ', vasiliy)
print('Иван - ', ivan)

```
7) Вовочка, насмотревшись передачи “Слабое звено” решил написать
   программу, которая также будет находить самое слабое звено
   (минимальный элемент) и удалять его, только делать он это хочет не с
   людьми, а со списком. Помогите Вовочке с реализацией программы.
   Подсказка: для этого вам необходимо отсортировать список и удалить
   значение при помощи pop()
```
a = [1, 3, -34, 56, -45, 304]
a.sort()
print('sorted list = ', a)
a.pop(0)
print('sorted without min - ', a)
```
8) Михаил решил создать большой n-мерный список, для этого он
   случайным образом создал несколько списков, состоящих минимум из
   3, а максимум из 10 элементов и поместил их в один большой список.
   Он также как и Иван не знает зачем ему это сейчас нужно, но надеется
   на то, что это пригодится ему в будущем.
```
from random import randint


def list_maker():
    a = [randint(1, 100)] * randint(3, 10)
    return a


if __name__ == '__main__':
    result = []
    for i in range(randint(1, 5)):
        result.append(list_maker())

    print(result)

```
9) Вы работаете в ресторане и отвечает за статистику покупок, ваша
   задача сравнить между собой заказы покупателей, которые указаны в
   разном порядке. Реализуйте функцию superset(), которая принимает 2
   множества. Результат работы функции: вывод в консоль одного из
   сообщений в зависимости от ситуации:
   1 - «Супермножество не обнаружено»
   2 – «Объект {X} является чистым супермножеством»
   3 – «Множества равны»
```
def superset(set1, set2):
    if set1 > set2:
        print(f'Object {set1} is superset')
    elif set1 == set2:
        print('sets are equal')
    elif set1 < set2:
        print(f'Object {set2} is superset')
    else:
        print('No superset')


if __name__ == '__main__':
    superset({1, 8, 3, 5}, {3, 5})
    superset({90, 100}, {3, 5})

```
10) Предположим, что вам нужно разобрать стопку бумаг, но нужно
    начать работу с нижней, “переверните стопку”. Вам дан произвольный
    список. Представьте его в обратном порядке. Программа должна
    занимать не более двух строк в редакторе кода.
```
lst = list(range(4))
print(lst[::-1])
```
