**Лабораторная работа 7**

**ТЕМА 7. Работа с файлами (ввод, вывод)**

**Лабораторные задания:**

1) Составьте текстовый файл и положите его в одну директорию с
   программой на Python. Текстовый файл должен состоять минимум из
   двух строк.

2) Напишите программу, которая выведет только первую строку из
   вашего файла, при этом используйте конструкцию open()/close().
```
f = open('input.txt', 'r')
print(f.readline())
f.close()
```

3) Напишите программу, которая выведет все строки из вашего файла в
   массиве, при этом используйте конструкцию open()/close().
```
f = open('input.txt', 'r')
print(f.readlines())
f.close()

```
4) Напишите программу, которая выведет все строки из вашего файла в
   массиве, при этом используйте конструкцию with open()
```
with open('input.txt') as f:
    print(f.readlines())
```

5) Напишите программу, которая выведет каждую строку из вашего
   файла отдельно, при этом используйте конструкцию with open().
```
with open('input.txt') as f:
    for line in f:
        print(line)
```
6) Напишите программу, которая будет добавлять новую строку в ваш
   файл, а потом выведет полученный файл в консоль. Вывод можно
   осуществлять любым способом. Обязательно проверьте сам файл,
   чтобы изменения в нем тоже отображались
```
with open('input.txt', 'a+') as f:
    f.write('\nnew line')

with open('input.txt') as f:
    print(f.readlines())

```
7) Напишите программу, которая перепишет всю информацию, которая
   была у вас в файле до этого, например напишет любые данные из
   произвольно вами составленного списка. Также не забудьте проверить
   что измененная вами информация сохранилась в файле.
```
lines = ['one', '2', 'three']
with open('input.txt', 'w') as f:
    for line in lines:
        f.write(line)
    print('done')

with open('input.txt') as f:
    print(f.readlines())
```
8) Выберите любую папку на своем компьютере, имеющую вложенные
   директории. Выведите на печать в терминал ее содержимое, как и всех
   подкаталогов при помощи функции print_docs(directory).
```
import os


def print_docs(dir):
    all_files = os.walk(dir)
    for catalog in all_files:
        print(f'Folder {catalog} contains:')
    print(f'Directories: {", ".join([folder for folder in catalog[1]])}')
    print(f'Files: {", ".join([file for file in catalog[2]])}')
    print('-' * 40)


print_docs('..')

```
9) Документ «input.txt» содержит следующий текст:
   Приветствие
   Спасибо
   Извините
   Пожалуйста
   До свидания
   Ты готов?
   Как дела?
   С днем рождения!
   Удача!
   Я тебя люблю.
   Требуется реализовать функцию, которая выводит слово, имеющее
   максимальную длину (или список слов, если таковых несколько).
   Проверьте работоспособность программы на своем наборе данных
```
def longest_word(file):
    with open(file, encoding='utf-8') as f:
        words = f.read().split()
        max_lenght = len(max(words, key=len))
        for word in words:
            if len(word) == max_lenght:
                sought_words = word
        if len(sought_words) == 1:
            return sought_words[0]
        return sought_words


print(longest_word('input.txt'))

```
10) Требуется создать csv-файл «rows_300.csv» со следующими
    столбцами:
    • № - номер по порядку (от 1 до 300);
    Михаил А. Панов
    • Секунда – текущая секунда на вашем ПК;
    • Микросекунда – текущая миллисекунда на часах.
    Для наглядности на каждой итерации цикла искусственно
    приостанавливайте скрипт на 0,01 секунды.
```
import csv
import datetime
import time


with open('rows_300.csv', 'w', encoding='utf-8', newline='') as f:
    writer = csv.writer(f)
    writer.writerow(['№', 'Секунда', 'Микросекунда'])
    for line in range(1, 301):
        writer.writerow([line, datetime.datetime.now().second, datetime. datetime.now().microsecond])
        time.sleep(0.01)
```
